{
    "@metadata": {
        "authors": [
            "Azountas",
            "Babispan",
            "Evropi",
            "Gchr",
            "GhotuoIncubator",
            "Indoril",
            "KATRINE1992",
            "Namatreasure",
            "NikosLikomitros",
            "Nikosgranturismogt",
            "Norhorn",
            "Sfyrakis",
            "Tifa93"
        ]
    },
    "Games.name": "Πληροφορίες",
    "Games.maze": "MazeGame 1",
    "Games.linesOfCode1": "Ο κώδικας σας αποτελείται από 1 γραμμή JavaScript:",
    "Games.linesOfCode2": "Ο κώδικας σας αποτελείται από %1 γραμμές κώδικα JavaScript:",
    "Games.nextLevel": "Είστε έτοιμοι για το επίπεδο %1;",
    "Games.finalLevel": "Ολοκληρώσατε τον Λαβύρινθο!",
    "Games.submitTitle": "Τίτλος:",
    "Games.linkTooltip": "Αποθηκεύει και συνδέει σε μπλοκ.",
    "Games.runTooltip": "Εκτελέστε το πρόγραμμα που γράψατε.",
    "Games.runProgram": "Παίξε",
    "Games.submitTooltip": "Υποβάλετε τη λύση σας",
    "Games.submitProgram": "Υποβολή",
    "Games.resetTooltip": "Διακοπή του προγράμματος και επαναφορά του επιπέδου.",
    "Games.resetProgram": "Επαναφορά",
    "Games.help": "Βοήθεια",
    "Games.dialogOk": "Εντάξει",
    "Games.dialogCancel": "Ακύρωση",
    "Games.catLogic": "Λογική",
    "Games.catLoops": "Επαναλήψεις",
    "Games.catMath": "Μαθηματικά",
    "Games.catText": "Κείμενο",
    "Games.catLists": "Λίστες",
    "Games.catColour": "Χρώμα",
    "Games.catVariables": "Μεταβλητές",
    "Games.catProcedures": "Συναρτήσεις",
    "Games.httpRequestError": "Υπήρξε πρόβλημα με το αίτημα.",
    "Games.linkAlert": "Κοινοποίησε τα μπλοκ σου με αυτόν τον σύνδεσμο:\n\n%1",
    "Games.hashError": "Λυπάμαι, το «%1» δεν αντιστοιχεί σε κανένα αποθηκευμένο πρόγραμμα.",
    "Games.xmlError": "Δεν μπορώ να φορτώσω το αποθηκευμένο αρχείο σου.  Μήπως δημιουργήθηκε από μία παλιότερη έκδοση του Blockly;",
    "Games.submitted": "Σας ευχαριστούμε για το πρόγραμμα! Εάν αρέσει στο προσωπικό των εκπαιδευμένων μαϊμούδων μας, θα το δημοσιεύσουν στην γκαλερί εντός δύο ημερών.",
    "Games.listVariable": "λίστα",
    "Games.textVariable": "κείμενο",
    "Games.breakLink": "Μόλις αρχίσετε την επεξεργασία JabaScript,δεν μπορείτε να επιστρέψετε στα μπλοκ. Είναι αυτό εντάξει;",
    "Games.blocks": "Μπλοκ",
    "Games.congratulations": "Συγχαρητήρια!",
    "Games.submitWrong": "Η λύση σας δεν είναι σωστή.",
    "Games.helpAbort": "Αυτό το επίπεδο είναι εξαιρετικά δύσκολο. Θα θέλατε να το παραλείψετε και να πάτε στο επόμενο παιχνίδι; Μπορείτε πάντα να επανέλθετε αργότερα.",
    "Index.clear": "Θέλετε να διαγράψετε όλες τις λύσεις;",
    "Index.subTitle": "Το παιχνίδι είναι βασισμένο στα παιχνίδια: ",
    "Index.moreInfo": "Blockly Games",
    "Index.startOver": "Θέλετε να ξεκινήσετε πάλι από την αρχή;",
    "Index.clearData": "Εκκαθάριση δεδομένων",
    "Maze.moveForward": "προχώρησε ευθεία",
    "Maze.turnLeft": "στρίψε αριστερά",
    "Maze.turnRight": "στρίψε δεξιά",
    "Maze.doCode": "κάνε",
    "Maze.elseCode": "αλλιώς",
    "Maze.helpIfElse": "Τα μπλοκ «εάν...αλλιώς» θα κάνουν είτε το ένα είτε το άλλο.",
    "Maze.pathAhead": "αν διαδρομή μπροστά",
    "Maze.pathLeft": "αν διαδρομή προς τα αριστερά",
    "Maze.pathRight": "αν διαδρομή προς τα δεξιά",
    "Maze.repeatUntil": "επανάλαβε μέχρι",
    "Maze.moveForwardTooltip": "Κινεί τον χαρακτήρα μία θέση μπροστά.",
    "Maze.turnTooltip": "Στρίβει το ανθρωπάκι αριστερά ή δεξιά κατά 90 μοίρες.",
    "Maze.ifTooltip": "Αν υπάρχει μονοπάτι προς τη συγκεκριμένη κατεύθυνση, τότε εκτελεί κάποιες ενέργειες.",
    "Maze.ifelseTooltip": "Αν υπάρχει μονοπάτι προς τη συγκεκριμένη κατεύθυνση, τότε εκτελεί το πρώτο μπλοκ των δράσεων. Διαφορετικά, εκτελεί το δεύτερο μπλοκ των δράσεων.",
    "Maze.whileTooltip": "Επαναλαμβάνει τις περικλειόμενες ενέργειες μέχρι να φθάσει στο τέρμα.",
    "Maze.capacity0": "Σου απομένουν %0 μπλοκ.",
    "Maze.capacity1": "Σου απομένουν %1 μπλοκ.",
    "Maze.capacity2": "Σου απομένουν %2 μπλοκ.",
    "Maze.runTooltip": "Κάνει τον χαρακτήρα να κάνει αυτό που λένε τα μπλοκ.",
    "Maze.submitTooltip": "Υποβάλετε το αποτέλεσμα.",
    "Maze.resetTooltip": "Βάζει το ανθρωπάκι πίσω στην αρχή του λαβυρίνθου.",
    "Maze.helpStack": "Ένα από τα blocks είναι λάθος. Αφού δοκιμάσετε να εκτελέσετε τον κώδικα πατώντας το 'Παίξε', αλλάξτε το block που πρέπει για να φτάσει ο παίκτης στο τέρμα.",
    "Maze.helpOneTopBlock": "Σε αυτό το επίπεδο, πρέπει να στοιβάξεις όλα τα μπλοκ στον λευκό χώρο εργασίας.",
    "Maze.helpRun": "Εκτέλεσε το πρόγραμμά σου και δες τι συμβαίνει.",
    "Maze.helpReset": "Το πρόγραμμα σου δεν έλυσε τον λαβύρινθο. Πάτησε «Επαναφορά» και δοκίμασε άλλη μια φορά.",
    "Maze.helpRepeat": "Προσπάθησε να φτάσεις στο τέλος του μονοπατιού χρησιμοποιώντας μόνο δύο μπλοκ. Χρησιμοποίησε το μπλοκ «επανάλαβε» για να εκτελέσεις το μπλοκ που θέλεις περισσότερες φορές.",
    "Maze.helpCapacity": "Έχουν εξαντληθεί όλα τα μπλοκ για αυτό το επίπεδο.  Για να δημιουργήσεις ένα νέο μπλοκ, θα πρέπει πρώτα να διαγράψεις ένα υπάρχον μπλοκ.",
    "Maze.helpRepeatMany": "Μπορείς να στριμώξεις περισσότερο από ένα μπλοκ μέσα σε μπλοκ «επανάληψη».",
    "Maze.helpSkins": "Επίλεξε τον αγαπημένο σου χαρακτήρα από αυτό το μενού.",
    "Maze.helpIf": "Μια συνθήκη «εάν» θα εκτελέσει κάτι μόνο αν είναι αληθής. Προσπάθησε να στρίψεις αριστερά, εάν υπάρχει μονοπάτι προς τα αριστερά.",
    "Maze.helpMenu": "Κάνε κλικ στο %1 μέσα στο μπλοκ «εάν» για να αλλάξεις την κατάστασή του.",
    "Maze.helpWallFollow": "Μπορείς να επιλύσεις αυτόν τον περίπλοκο λαβύρινθο; Προσπάθησε να ακολουθήσεις τον αριστερό τοίχο. Μόνο για προχωρημένους προγραμματιστές!",
    "Maze.helpPlay11": "Κάνοντας κλικ στο βέλος του block 'στρίψε' μπορείτε να αλλάξετε την κατεύθυνση που στρίβει ο παίκτης.",
    "Maze.helpPlay12": "Κάποια από τις στροφές που παίρνει ο παίκτης είναι λάθος.",
    "Maze.helpPlay21": "Το 'επανέλαβε' χρησιμοποιείται για να εκτελεστούν ένα ή περισσότερα blocks περισσότερες από μια φορές.",
    "Maze.helpPlay22": "Πόσα βήματα πρέπει να κάνει ο παίκτης πριν στρίψει αριστερά; Πόσα κάνει τώρα;",
    "Maze.helpPlay31": "Ένα επανέλαβε μπορεί να μπει μέσα σε ένα άλλο.",
    "Maze.helpPlay32": "Πόσα βήματα πρέπει να κάνει ο παίκτης για να καλύψει κάθε πλευρά του μονοπατιού και άρα πόσες φορές πρέπει να εκτελεστεί το block 'προχώρησε ευθεία'; Σε ποιο από τα δυο επανέλαβε πρέπει να αλλάξετε τον αριθμό των φορών που εκτελούνται τα blocks;",
    "Maze.helpPlay41": "Ένα μπλοκ «Αν» θα κάνει κάτι μόνο αν η συνθήκη είναι αληθής. Δοκιμάστε να στρίψει ο παίκτης δεξιά αν υπάρχει διαδρομή προς τα δεξιά.",
    "Maze.helpPlay51": "Το 'επανάλαβε μέχρι' χρησιμοποιείται για να εκτελεστούν ένα ή περισσότερα blocks μέχρι μια συνθήκη να γίνει αληθής, για παράδειγμα μέχρι να φτάσει ο παίκτης στο τέρμα. Δοκιμάστε να στρίψει ο παίκτης αριστερά εάν η διαδρομή είναι προς τα αριστερά. Αντίστοιχα προς τα που πρέπει να στρίψει ο παίκτης εάν η διαδρομή είναι προς τα δεξιά;",
    "Maze.helpPlay61": "Στo block 'Αν-αλλιώς' εκτελείται το 'κάνε' ή το 'αλλιώς' . Το 'κάνε' εκτελείται αν η συνθήκη είναι αληθής, ενώ το 'αλλιώς' αν η συνθήκη είναι ψευδής. Επιπλέον, Ένα block 'Αν-αλλιώς' μπορεί να μπει μέσα σε ένα άλλο. Δοκιμάστε να στρίψει ο παίκτης δεξιά εάν υπάρχει διαδρομή προς τα δεξιά. Αλλιώς αν η διαδρομή είναι προς τα αριστερά ποιο block πρέπει να εκτελεστεί;",
    "Maze.helpPlay71": "Αν υπάρχει μονοπάτι τότε ο παίκτης θα προχωρήσει μπροστά?",
    "Maze.helpPlay72": "Πόσε φορές πρέπει να επαναληφθεί η εντολή 'φάε' για να φάει ο παίκτης και τα 3 αντικείμενα;",
    "Maze.mazeDone": "Έχετε ολοκληρώσει το παιχνίδι!!",
    "Maze.headerHelp": "Οδηγίες:",
    "Maze.helpLevel1": "Διορθώστε τα blocks ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel3": "Διόρθωσε τις επιλογές των blocks ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel2": "Διορθώστε τα blocks ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel4": "Συμπληρώστε τα blocks έτσι ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel5": "Διορθώστε τα blocks ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel6": "Συμπληρώστε την εντολή στο αλλιώς ώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.helpLevel7": "Χρησιμοποιήστε τα κατάλληλα μπλοκώστε ο παίκτης να οδηγηθεί στο τέρμα ακολουθώντας το μονοπάτι.",
    "Maze.outcomeResult": "Αποτελέσματα",
    "Maze.outcomePlay": "Πλήθος 'Παίξε': ",
    "Maze.outcomeRLevel": "Αποτέλεσμα Επιπέδου: ",
    "Maze.levelScore": "Βαθμολογία επιπέδου: ",
    "Maze.totalScore": "Συνολική Βαθμολογία: ",
    "Maze.outcomeSuccess": "Επιτυχία",
    "Maze.outcomeFail": "Αποτυχία"
}